{"class_name": "Model", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxwAAAB8AGQAZACFAmQAZAGFAmYCGQBkAhQAZAEXAFMAKQNO\n6QEAAADpAAAAAKkAKQHaAXhyAwAAAHIDAAAA+g9zdHlsZWdhbl90d28ucHnaCDxsYW1iZGE+AQEA\nAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 128]}, "name": "reshape", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "linear"}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["input_11", 0, 0, {}], ["activation", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod", "inbound_nodes": [[["activation", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["conv2d_mod", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_17", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_1", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["conv2d_mod_1", 0, 0, {}], ["dense_12", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_18", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVLAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 8, 8, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["input_11", 0, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_3", "inbound_nodes": [[["lambda_3", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["conv2d_mod_3", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_19", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_4", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "name": "add_9", "inbound_nodes": [[["conv2d_mod_4", 0, 0, {}], ["dense_17", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_20", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVLAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 16, 16, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["input_11", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_6", "inbound_nodes": [[["lambda_6", 0, 0, {}], ["dense_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "name": "add_10", "inbound_nodes": [[["conv2d_mod_6", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_21", "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_7", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_7", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["dense_21", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "name": "add_11", "inbound_nodes": [[["conv2d_mod_7", 0, 0, {}], ["dense_22", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_22", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVLAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 32, 32, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_10", "inbound_nodes": [[["input_11", 0, 0, {}], ["lambda_9", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_9", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_9", "inbound_nodes": [[["lambda_9", 0, 0, {}], ["dense_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "name": "add_12", "inbound_nodes": [[["conv2d_mod_9", 0, 0, {}], ["dense_25", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_23", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_10", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["dense_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "inbound_nodes": [[["conv2d_mod_10", 0, 0, {}], ["dense_27", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_24", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVLAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["input_11", 0, 0, {}], ["lambda_12", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_12", "inbound_nodes": [[["lambda_12", 0, 0, {}], ["dense_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "inbound_nodes": [[["conv2d_mod_12", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_25", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_13", "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}], ["dense_31", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_32", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "inbound_nodes": [[["conv2d_mod_13", 0, 0, {}], ["dense_32", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_26", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVLAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_15", "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "name": "input_10", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_34", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0RAAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_16", "inbound_nodes": [[["input_11", 0, 0, {}], ["lambda_15", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_15", "inbound_nodes": [[["lambda_15", 0, 0, {}], ["dense_34", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_35", "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_16", "trainable": true, "dtype": "float32"}, "name": "add_16", "inbound_nodes": [[["conv2d_mod_15", 0, 0, {}], ["dense_35", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_27", "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_36", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_16", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "name": "conv2d_mod_16", "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}], ["dense_36", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_37", "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "name": "add_17", "inbound_nodes": [[["conv2d_mod_16", 0, 0, {}], ["dense_37", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_28", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.5625, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_33", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_2", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_5", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_5", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_8", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_8", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}], ["dense_18", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_11", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_14", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_14", "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}], ["dense_28", 0, 0, {}]]]}, {"class_name": "Conv2DMod", "config": {"name": "conv2d_mod_17", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.5625, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "name": "conv2d_mod_17", "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}], ["dense_33", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["conv2d_mod_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["conv2d_mod_5", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["conv2d_mod_8", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_11", "inbound_nodes": [[["conv2d_mod_11", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_14", "inbound_nodes": [[["conv2d_mod_14", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyoAAAB0AHQBfABqAmQBGQAbAIMBfQF0A2oEfAB8AXwBZAJk\nA2QEjQV9AHwAUwApBU7pAgAAANoNY2hhbm5lbHNfbGFzdNoIYmlsaW5lYXIpAdoNaW50ZXJwb2xh\ndGlvbikF2gNpbnTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHIM\nAAAA+g9zdHlsZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVOAAAAcwYAAAAAARIBFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_17", "inbound_nodes": [[["conv2d_mod_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "name": "add_18", "inbound_nodes": [[["lambda_2", 0, 0, {}], ["lambda_5", 0, 0, {}], ["lambda_8", 0, 0, {}], ["lambda_11", 0, 0, {}], ["lambda_14", 0, 0, {}], ["lambda_17", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AGQBGwBkAhcAUwApA07pAgAAAGcAAAAAAADgP6kA\nKQHaAXlyAgAAAHICAAAA+g9zdHlsZWdhbl90d28ucHnaCDxsYW1iZGE+MgEAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_18", "inbound_nodes": [[["add_18", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0], ["input_10", 0, 0], ["input_11", 0, 0]], "output_layers": [["lambda_18", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}